# KN Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KN Property
SymbolTypeId Class See Also
---
Symbol kN, indicating unit Kilonewtons.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KN { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KN As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KN {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace